tests/Unit/Api/UnbilledCharges/data/responses/unbilled_charge_estimate_created.json

{
  "estimate": {
    "created_at": 1506418668,
    "object": "estimate",
    "invoice_estimates": [
      {
        "recurring": true,
        "price_type": "tax_exclusive",
        "sub_total": 1000,
        "total": 1000,
        "credits_applied": 0,
        "amount_paid": 0,
        "amount_due": 1000,
        "object": "invoice_estimate",
        "line_items": [
          {
            "id": "li_3Nl8LlrQWK3AE22k",
            "date_from": 1506418656,
            "date_to": 1509010656,
            "unit_amount": 1000,
            "quantity": 1,
            "is_taxed": false,
            "tax_amount": 0,
            "object": "line_item",
            "subscription_id": "addams",
            "amount": 1000,
            "description": "No Trial",
            "entity_type": "plan",
            "entity_id": "no_trial",
            "discount_amount": 0,
            "item_level_discount_amount": 0
          }
        ],
        "taxes": [],
        "line_item_taxes": [],
        "currency_code": "USD",
        "line_item_discounts": []
      }
    ]
  }
}