tests/Unit/Api/UnbilledCharges/data/responses/unbilled_charge_invoice_created.json

{
  "invoices": [
    {
      "id": "41",
      "customer_id": "super_saver",
      "subscription_id": "super_saver",
      "recurring": true,
      "status": "payment_due",
      "price_type": "tax_exclusive",
      "date": 1506418668,
      "due_date": 1506418668,
      "net_term_days": 0,
      "exchange_rate": 1.0,
      "total": 1000,
      "amount_paid": 0,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 1000,
      "updated_at": 1506418668,
      "resource_version": 1506418668000,
      "deleted": false,
      "object": "invoice",
      "first_invoice": true,
      "amount_to_collect": 1000,
      "new_sales_amount": 1000,
      "has_advance_charges": false,
      "currency_code": "USD",
      "base_currency_code": "USD",
      "tax": 0,
      "line_items": [
        {
          "id": "li_3Nl8LlrQWK3A8r2e",
          "date_from": 1506418656,
          "date_to": 1509010656,
          "unit_amount": 1000,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "subscription_id": "super_saver",
          "amount": 1000,
          "description": "No Trial",
          "entity_type": "plan",
          "entity_id": "no_trial",
          "tax_exempt_reason": "tax_not_configured",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        }
      ],
      "sub_total": 1000,
      "linked_payments": [],
      "applied_credits": [],
      "adjustment_credit_notes": [],
      "issued_credit_notes": [],
      "linked_orders": [],
      "billing_address": {
        "first_name": "Rudolf",
        "last_name": "Bob",
        "validation_status": "not_validated",
        "object": "billing_address"
      }
    }
  ]
}